In [1]:
import pandas as pd
import sqlalchemy

In [ ]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/application')

In [ ]:
df=pd.read_sql_table("customers",engine)
df

In [ ]:
df=pd.read_sql_table("customers",engine,columns=['name','phone_nummber'])
df

In [ ]:
query = '''
 SELECT customers.name, customers.phone_number, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
df = pd.read_sql_query(query,engine)
df

In [5]:
df=pd.read_csv('F:\py\pandas\sqlqyeru\customer.csv')

In [6]:
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [12]:
df.rename(columns={
'Customer Name':'name',
'Customer Phone':'phone_number'},inplace=True)

In [13]:
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [ ]:
df.to_sql(
name='customer',
con=engine,
index=False,
if_exists='append')

In [ ]:
pd.read_sql("customers",engine)